#+LANGUAGE: es
#+CATEGORY:
#+TAGS: 
#+DESCRIPTION: Acometer un proyecto en Medialab-Prado
#+TITLE: Operaciones lógicas con datos
#+DATE: [2016-10-26 mié 17:00]
#+AUTHOR: Adolfo A. Bravo y Pilar J. López
#+EMAIL: adolfo@medialab-prado.es pilarjlopez@hotmail.com
#+OPTIONS: todo:nil pri:nil tags:nil ^:nil 

#+OPTIONS: reveal_center:t reveal_progress:t reveal_history:nil reveal_control:t
#+OPTIONS: reveal_mathjax:t reveal_rolling_links:t reveal_keyboard:t reveal_overview:t num:nil
#+OPTIONS: reveal_width:1200 reveal_height:800
#+OPTIONS: toc:nil
#+REVEAL_MARGIN: 0.1
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.5
#+REVEAL_TRANS: linear
#+REVEAL_THEME: sky
#+REVEAL_HLEVEL: 2
#+REVEAL_HEAD_PREAMBLE: <meta name="description" content="Org-Reveal Introduction.">
#+REVEAL_POSTAMBLE: <p> Creado por adolflow. </p>
#+REVEAL_PLUGINS: (highlight markdown notes)
#+REVEAL_ROOT: file:///home/flow/ownCloud/docs/softwarelibre/emacs/reveal.js/
#+REVEAL_ROOT: http://cdn.jsdelivr.net/reveal.js/3.0.0/

** Solo find
Si solo lanzamos =find=, nos devolverá los archivos, directorios y
subdirectorios por debajo del lugar donde nos encontramos:

#+BEGIN_SRC sh
pwd

#+END_SRC
: /home/flow/ownCloud/docs/softwarelibre/bash

Estamos en =/home/flow/ownCloud/docs/softwarelibre/bash=, vamos a ver
qué contiene este directorio:

#+BEGIN_SRC sh
find

#+END_SRC

#+RESULTS:
| 0                  |
| ./Readme.org       |
| ./.#Readme.org     |
| ./licitaciones.csv |
| ./rera_aragon.csv  |
| ./#Readme.org#     |
| ./Readme.org~      |

Que es lo mismo que hacer =find .= o =find . -print=.

